radiusList = {
  "도보": 800,
  "자전거": 2000,
  "자동차": 10000,
  "대중교통": 15000,
  "휠체어": 600
}

location = {
  "한국": {
    "서울": { "lat": 37.5665, "lon": 126.978 },
    "부산": { "lat": 35.1796, "lon": 129.0756 },
    "인천": { "lat": 37.4563, "lon": 126.7052 },
    "제주": { "lat": 33.4996, "lon": 126.5312 },
    "경주": { "lat": 35.8562, "lon": 129.2247 },
    "대구": { "lat": 35.8714, "lon": 128.6014 },
    "광주": { "lat": 35.1595, "lon": 126.8526 },
    "속초": { "lat": 38.207, "lon": 128.5914 },
    "대전": { "lat": 36.3504, "lon": 127.3845 },
    "수원": { "lat": 37.2636, "lon": 127.0286 }
  },
  "미국": {
    "뉴욕": { "lat": 40.7128, "lon": -74.006 },
    "로스앤젤레스": { "lat": 34.0522, "lon": -118.2437 },
    "샌프란시스코": { "lat": 37.7749, "lon": -122.4194 },
    "라스베이거스": { "lat": 36.1699, "lon": -115.1398 },
    "시카고": { "lat": 41.8781, "lon": -87.6298 },
    "워싱턴 D.C.": { "lat": 38.9072, "lon": -77.0369 },
    "마이애미": { "lat": 25.7617, "lon": -80.1918 },
    "보스턴": { "lat": 42.3601, "lon": -71.0589 },
    "올랜도": { "lat": 28.5383, "lon": -81.3792 },
    "뉴올리언스": { "lat": 29.9511, "lon": -90.0715 }
  },
  "독일": {
    "베를린": { "lat": 52.52, "lon": 13.405 },
    "뮌헨": { "lat": 48.1351, "lon": 11.582 },
    "프랑크푸르트": { "lat": 50.1109, "lon": 8.6821 },
    "쾰른": { "lat": 50.9375, "lon": 6.9603 },
    "함부르크": { "lat": 53.5511, "lon": 9.9937 },
    "하이델베르크": { "lat": 49.3988, "lon": 8.6724 },
    "슈투트가르트": { "lat": 48.7758, "lon": 9.1829 },
    "드레스덴": { "lat": 51.0504, "lon": 13.7373 },
    "뒤셀도르프": { "lat": 51.2277, "lon": 6.7735 },
    "라이프치히": { "lat": 51.3397, "lon": 12.3731 }
  },
  "프랑스": {
    "파리": { "lat": 48.8566, "lon": 2.3522 },
    "니스": { "lat": 43.7102, "lon": 7.262 },
    "마르세유": { "lat": 43.2965, "lon": 5.3698 },
    "리옹": { "lat": 45.764, "lon": 4.8357 },
    "보르도": { "lat": 44.8378, "lon": -0.5792 },
    "툴루즈": { "lat": 43.6047, "lon": 1.4442 },
    "낭트": { "lat": 47.2184, "lon": -1.5536 },
    "릴": { "lat": 50.6292, "lon": 3.0573 },
    "엑상프로방스": { "lat": 43.5297, "lon": 5.4474 },
    "칸": { "lat": 43.5528, "lon": 7.0174 }
  },
  "일본": {
    "도쿄": { "lat": 35.6762, "lon": 139.6503 },
    "오사카": { "lat": 34.6937, "lon": 135.5023 },
    "교토": { "lat": 35.0116, "lon": 135.7681 },
    "삿포로": { "lat": 43.0621, "lon": 141.3544 },
    "후쿠오카": { "lat": 33.5904, "lon": 130.4017 },
    "나고야": { "lat": 35.1815, "lon": 136.9066 },
    "히로시마": { "lat": 34.3853, "lon": 132.4553 },
    "오키나와": { "lat": 26.5013, "lon": 127.9454 },
    "가마쿠라": { "lat": 35.3192, "lon": 139.546 },
    "나라": { "lat": 34.6851, "lon": 135.8048 }
  },
  "중국": {
    "베이징": { "lat": 39.9042, "lon": 116.4074 },
    "상하이": { "lat": 31.2304, "lon": 121.4737 },
    "광저우": { "lat": 23.1291, "lon": 113.2644 },
    "시안": { "lat": 34.3416, "lon": 108.9398 },
    "청두": { "lat": 30.5723, "lon": 104.0665 },
    "선전": { "lat": 22.5431, "lon": 114.0579 },
    "항저우": { "lat": 30.2741, "lon": 120.1551 },
    "쿤밍": { "lat": 25.0389, "lon": 102.7183 },
    "난징": { "lat": 32.0603, "lon": 118.7969 },
    "하얼빈": { "lat": 45.8038, "lon": 126.5347 }
  },
  "영국": {
    "런던": { "lat": 51.5074, "lon": -0.1278 },
    "에든버러": { "lat": 55.9533, "lon": -3.1883 },
    "맨체스터": { "lat": 53.4808, "lon": -2.2426 },
    "리버풀": { "lat": 53.4084, "lon": -2.9916 },
    "글래스고": { "lat": 55.8642, "lon": -4.2518 },
    "브리스틀": { "lat": 51.4545, "lon": -2.5879 },
    "옥스퍼드": { "lat": 51.7548, "lon": -1.2544 },
    "케임브리지": { "lat": 52.2053, "lon": 0.1218 },
    "카디프": { "lat": 51.4816, "lon": -3.1791 },
    "요크": { "lat": 53.959, "lon": -1.0815 }
  },
  "스위스": {
    "취리히": { "lat": 47.3769, "lon": 8.5417 },
    "제네바": { "lat": 46.2044, "lon": 6.1432 },
    "루체른": { "lat": 47.0502, "lon": 8.3093 },
    "인터라켄": { "lat": 46.6863, "lon": 7.8632 },
    "바젤": { "lat": 47.5596, "lon": 7.5886 },
    "베른": { "lat": 46.9481, "lon": 7.4474 },
    "로잔": { "lat": 46.5197, "lon": 6.6323 },
    "체르마트": { "lat": 46.0207, "lon": 7.7491 },
    "루가노": { "lat": 46.0037, "lon": 8.9511 },
    "그린델발트": { "lat": 46.6244, "lon": 8.0414 }
  },
  "캐나다": {
    "토론토": { "lat": 43.6511, "lon": -79.3837 },
    "밴쿠버": { "lat": 49.2827, "lon": -123.1207 },
    "몬트리올": { "lat": 45.5017, "lon": -73.5673 },
    "퀘벡시티": { "lat": 46.8139, "lon": -71.2082 },
    "오타와": { "lat": 45.4215, "lon": -75.6972 },
    "캘거리": { "lat": 51.0447, "lon": -114.0719 },
    "에드먼턴": { "lat": 53.5461, "lon": -113.4938 },
    "빅토리아": { "lat": 48.4284, "lon": -123.3656 },
    "위니펙": { "lat": 49.8951, "lon": -97.1384 },
    "해밀턴": { "lat": 43.2557, "lon": -79.8711 }
  }
}


# 이동 수단에 따른 반경 목록
# 이동 수단에 따른 반경 목록
radiusList = {
  "도보": 1000,
  "자전거": 3000,
  "자동차": 10000,
  "대중교통": 20000,
  "휠체어": 800
}

# 국가 및 도시에 대한 답변 목록
countryCityMap = {
    "한국": [
        "서울",
        "부산",
        "인천",
        "제주",
        "경주",
        "대구",
        "광주",
        "속초",
        "대전",
        "수원",
    ],
    "미국": [
        "뉴욕",
        "로스앤젤레스",
        "샌프란시스코",
        "라스베이거스",
        "시카고",
        "워싱턴 D.C.",
        "마이애미",
        "보스턴",
        "올랜도",
        "뉴올리언스",
    ],
    "독일": [
        "베를린",
        "뮌헨",
        "프랑크푸르트",
        "쾰른",
        "함부르크",
        "하이델베르크",
        "슈투트가르트",
        "드레스덴",
        "뒤셀도르프",
        "라이프치히",
    ],
    "프랑스": [
        "파리",
        "니스",
        "마르세유",
        "리옹",
        "보르도",
        "툴루즈",
        "낭트",
        "릴",
        "엑상프로방스",
        "칸",
    ],
    "일본": [
        "도쿄",
        "오사카",
        "교토",
        "삿포로",
        "후쿠오카",
        "나고야",
        "히로시마",
        "오키나와",
        "가마쿠라",
        "나라",
    ],
    "중국": [
        "베이징",
        "상하이",
        "광저우",
        "시안",
        "청두",
        "선전",
        "항저우",
        "쿤밍",
        "난징",
        "하얼빈",
    ],
    "영국": [
        "런던",
        "에든버러",
        "맨체스터",
        "리버풀",
        "글래스고",
        "브리스틀",
        "옥스퍼드",
        "케임브리지",
        "카디프",
        "요크",
    ],
    "스위스": [
        "취리히",
        "제네바",
        "루체른",
        "인터라켄",
        "바젤",
        "베른",
        "로잔",
        "체르마트",
        "루가노",
        "그린델발트",
    ],
    "캐나다": [
        "토론토",
        "밴쿠버",
        "몬트리올",
        "퀘벡시티",
        "오타와",
        "캘거리",
        "에드먼턴",
        "빅토리아",
        "위니펙",
        "해밀턴",
    ],
}

# 여행 기간에 대한 답변 목록
travelDurationOptions = 5

# 이동 수단에 대한 답변 목록
transportationsOptions = ["도보", "자전거", "자동차", "대중교통", "휠체어", "기타"]

# 여행 테마에 대한 답변 목록
travelStyleOptions = [
    "체험/액티비티",
    "관람",
    "쇼핑",
    "먹방",
    "유명 관광지",
    "자연 속 힐링",
    "기타",
]

# 여행 우선순위에 대한 답변 목록
priorityOptions = ["높은 평점", "많은 리뷰", "짧은 이동거리", "여행 테마"]


# 관광지에 대한 답변 목록
categories = {
    "체험/액티비티": [
        "amusement_park", "aquarium", "bowling_alley", "zoo", "museum"
    ],
    "관람": [
        "art_gallery", "church", "hindu_temple", "synagogue", "performing_arts_theater"
    ],
    "쇼핑": [
        "book_store", "clothing_store", 
        "department_store", "electronics_store", "florist", "furniture_store", 
        "hardware_store", "home_goods_store", "jewelry_store", "liquor_store", 
        "shoe_store", "shopping_mall", "supermarket", "store"
    ],
    "먹방": [
        "bakery", "bar", "cafe", "restaurant"
    ],
    "유명 관광지": [
        "tourist_attraction", "historical_landmark"
    ],
    "자연 속 힐링": [
        "park", "campground", "rv_park"
    ],
    "기타": [
        "book_store", "athletic_field", "stadium", "library"
    ]
}